Autodesk.Revit.DB.ViewDisplayBackground.CreateSky
Creates an object that can be passed to View.SetBackground method
to set the background of the SunAndClouds type.
Returns:
New background object to pass to View.SetBackground.
Since:
2014

Autodesk.Revit.DB.ViewDisplayBackground.CreateImage(System.String,Autodesk.Revit.DB.ViewDisplayBackgroundImageFlags,Autodesk.Revit.DB.UV,Autodesk.Revit.DB.UV)
Creates an object that can be passed to View.SetBackground method
to set the background of the Image type.
imagePath:
File path with the image to be used.
flags:
Combination of flags (binary) that control how image is displayed in relation
to the view/crop boundary.
imageOffsets:
Horizontal (u) and vertical (v) offsets of the image.
imageScales:
Horizontal (u) and vertical (v) scales of the image (1 == no change).
Returns:
New background object to pass to View.SetBackground.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The file specified by imagePath is not an image file.
A valid image file should be in one of the following formats: bmp, jpg, jpeg, png, tif.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The  file specified by imagePath doesn't exist.
Since:
2014

Autodesk.Revit.DB.ViewDisplayBackground.CreateGradient(Autodesk.Revit.DB.Color,Autodesk.Revit.DB.Color,Autodesk.Revit.DB.Color)
Creates an object that can be passed to View.SetBackground method
to set the background of the Gradient type.
skyColor:
The top of the sky gradient if the sky is visible.
horizonColor:
The bottom or the sky gradient if the sky is visible,
or the top of the ground gradient otherwise.
groundColor:
The ground color if the sky is visible (ground shown in uniform color),
or the bottom of the ground gradient if the sky is not visible.
Returns:
New background object to pass to View.SetBackground.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014